{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:rdflib:RDFLib Version: 4.2.1\n",
      "INFO:requests.packages.urllib3.connectionpool:Starting new HTTPS connection (1): api.github.com\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Help on function build_swagger_spec in module grlc.utils:\n",
      "\n",
      "build_swagger_spec(user, repo, sha, serverName, prov)\n",
      "    Build grlc specification for the given github user / repo in swagger format\n",
      "\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:requests.packages.urllib3.connectionpool:Starting new HTTPS connection (1): api.github.com\n",
      "INFO:requests.packages.urllib3.connectionpool:Starting new HTTPS connection (1): api.github.com\n",
      "INFO:requests.packages.urllib3.connectionpool:Starting new HTTPS connection (1): raw.githubusercontent.com\n",
      "INFO:grlc.utils:===================================================================\n",
      "INFO:grlc.utils:Processing SPARQL query: dbpedia_test.rq\n",
      "INFO:grlc.utils:===================================================================\n",
      "INFO:grlc.gquery:Trying to parse udpate query\n",
      "ERROR:grlc.gquery:Could not parse UPDATE query\n",
      "ERROR:grlc.gquery:\n",
      "select distinct ?type where {[] a ?type} LIMIT 20\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/grlc/gquery.py\", line 213, in get_metadata\n",
      "    parsed_query = UpdateUnit.parseString(rq, parseAll=True)\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/pyparsing.py\", line 1129, in parseString\n",
      "    raise exc\n",
      "ParseException: Expected end of text (at char 150), (line:8, col:1)\n",
      "ERROR:grlc.gquery:None\n",
      "INFO:grlc.gquery:Finished parsing query of type SelectQuery\n",
      "INFO:grlc.gquery:Decorator guessed endpoint: http://dbpedia.org/sparql\n",
      "INFO:requests.packages.urllib3.connectionpool:Starting new HTTPS connection (1): raw.githubusercontent.com\n",
      "INFO:grlc.utils:===================================================================\n",
      "INFO:grlc.utils:Processing SPARQL query: ghostbusters_tracks.rq\n",
      "INFO:grlc.utils:===================================================================\n",
      "INFO:grlc.gquery:Trying to parse udpate query\n",
      "ERROR:grlc.gquery:Could not parse UPDATE query\n",
      "ERROR:grlc.gquery:\n",
      "PREFIX mid: <http://example.org/midi/>\n",
      "\n",
      "SELECT ?track WHERE {\n",
      "    ?track a mid:Track .\n",
      "}\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/grlc/gquery.py\", line 213, in get_metadata\n",
      "    parsed_query = UpdateUnit.parseString(rq, parseAll=True)\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/pyparsing.py\", line 1129, in parseString\n",
      "    raise exc\n",
      "ParseException: Expected end of text (at char 258), (line:9, col:1)\n",
      "ERROR:grlc.gquery:None\n",
      "INFO:grlc.gquery:Finished parsing query of type SelectQuery\n",
      "INFO:grlc.gquery:Decorator guessed endpoint: https://raw.githubusercontent.com/albertmeronyo/lodapi/master/ghostbusters.ttl\n",
      "INFO:requests.packages.urllib3.connectionpool:Starting new HTTPS connection (1): raw.githubusercontent.com\n",
      "INFO:grlc.utils:===================================================================\n",
      "INFO:grlc.utils:Processing SPARQL query: houseType_params.rq\n",
      "INFO:grlc.utils:===================================================================\n",
      "WARNING:grlc.gquery:Query metadata could not be parsed; check your YAML syntax\n",
      "INFO:grlc.gquery:Trying to parse udpate query\n",
      "ERROR:grlc.gquery:Could not parse UPDATE query\n",
      "ERROR:grlc.gquery:\n",
      "PREFIX cedar: <http://lod.cedar-project.nl:8888/cedar/resource/>\n",
      "PREFIX maritalstatus: <http://lod.cedar-project.nl/vocab/cedar-maritalstatus#>\n",
      "PREFIX sdmx-dimension: <http://purl.org/linked-data/sdmx/2009/dimension#>\n",
      "PREFIX sdmx-code: <http://purl.org/linked-data/sdmx/2009/code#>\n",
      "PREFIX cedarterms: <http://lod.cedar-project.nl/vocab/cedar#>\n",
      "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
      "PREFIX gg: <http://www.gemeentegeschiedenis.nl/amco/>\n",
      "\n",
      "SELECT (SUM(?pop) AS ?tot) FROM <urn:graph:cedar-mini:release> WHERE {\n",
      "\t?obs a qb:Observation.\n",
      "\t?obs sdmx-dimension:refArea ?_location_iri.\n",
      "\t?obs cedarterms:Kom ?_Kom_iri.\n",
      "\t?obs cedarterms:population ?pop.\n",
      "\t?slice a qb:Slice.\n",
      "\t?slice qb:observation ?obs.\n",
      "\t?slice sdmx-dimension:refPeriod ?_year_integer.\n",
      "\t?obs cedarterms:houseType ?_houseType_iri.\n",
      "\t?obs cedarterms:residenceStatus ?_residenceStatus_iri .\n",
      "\tFILTER (NOT EXISTS {?obs cedarterms:isTotal ?total })\n",
      "}\n",
      "# foo bar\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/grlc/gquery.py\", line 213, in get_metadata\n",
      "    parsed_query = UpdateUnit.parseString(rq, parseAll=True)\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/pyparsing.py\", line 1129, in parseString\n",
      "    raise exc\n",
      "ParseException: Expected end of text (at char 832), (line:20, col:1)\n",
      "ERROR:grlc.gquery:None\n",
      "INFO:grlc.gquery:Finished parsing query of type SelectQuery\n",
      "WARNING:grlc.gquery:Query metadata could not be parsed; check your YAML syntax\n",
      "INFO:requests.packages.urllib3.connectionpool:Starting new HTTPS connection (1): raw.githubusercontent.com\n",
      "WARNING:grlc.gquery:No endpoint specified, using default (http://virtuoso.clariah-sdh.eculture.labs.vu.nl/sparql)\n",
      "WARNING:grlc.gquery:Query metadata could not be parsed; check your YAML syntax\n",
      "INFO:grlc.gquery:Trying to parse udpate query\n",
      "ERROR:grlc.gquery:Could not parse UPDATE query\n",
      "ERROR:grlc.gquery:\n",
      "PREFIX cedar: <http://lod.cedar-project.nl:8888/cedar/resource/>\n",
      "PREFIX maritalstatus: <http://lod.cedar-project.nl/vocab/cedar-maritalstatus#>\n",
      "PREFIX sdmx-dimension: <http://purl.org/linked-data/sdmx/2009/dimension#>\n",
      "PREFIX sdmx-code: <http://purl.org/linked-data/sdmx/2009/code#>\n",
      "PREFIX cedarterms: <http://lod.cedar-project.nl/vocab/cedar#>\n",
      "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
      "PREFIX gg: <http://www.gemeentegeschiedenis.nl/amco/>\n",
      "\n",
      "SELECT (SUM(?pop) AS ?tot) FROM <urn:graph:cedar-mini:release> WHERE {\n",
      "\t?obs a qb:Observation.\n",
      "\t?obs sdmx-dimension:refArea ?_location_iri.\n",
      "\t?obs cedarterms:Kom ?_Kom_iri.\n",
      "\t?obs cedarterms:population ?pop.\n",
      "\t?slice a qb:Slice.\n",
      "\t?slice qb:observation ?obs.\n",
      "\t?slice sdmx-dimension:refPeriod ?_year_integer.\n",
      "\t?obs cedarterms:houseType ?_houseType_iri.\n",
      "\t?obs cedarterms:residenceStatus ?_residenceStatus_iri .\n",
      "\tFILTER (NOT EXISTS {?obs cedarterms:isTotal ?total })\n",
      "}\n",
      "# foo bar\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/grlc/gquery.py\", line 213, in get_metadata\n",
      "    parsed_query = UpdateUnit.parseString(rq, parseAll=True)\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/pyparsing.py\", line 1129, in parseString\n",
      "    raise exc\n",
      "ParseException: Expected end of text (at char 832), (line:20, col:1)\n",
      "ERROR:grlc.gquery:None\n",
      "INFO:grlc.gquery:Finished parsing query of type SelectQuery\n",
      "WARNING:grlc.gquery:Query metadata could not be parsed; check your YAML syntax\n",
      "INFO:grlc.gquery:Trying to parse udpate query\n",
      "ERROR:grlc.gquery:Could not parse UPDATE query\n",
      "ERROR:grlc.gquery:\n",
      "PREFIX cedar: <http://lod.cedar-project.nl:8888/cedar/resource/>\n",
      "PREFIX maritalstatus: <http://lod.cedar-project.nl/vocab/cedar-maritalstatus#>\n",
      "PREFIX sdmx-dimension: <http://purl.org/linked-data/sdmx/2009/dimension#>\n",
      "PREFIX sdmx-code: <http://purl.org/linked-data/sdmx/2009/code#>\n",
      "PREFIX cedarterms: <http://lod.cedar-project.nl/vocab/cedar#>\n",
      "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
      "PREFIX gg: <http://www.gemeentegeschiedenis.nl/amco/>\n",
      "\n",
      "SELECT (SUM(?pop) AS ?tot) FROM <urn:graph:cedar-mini:release> WHERE {\n",
      "\t?obs a qb:Observation.\n",
      "\t?obs sdmx-dimension:refArea ?_location_iri.\n",
      "\t?obs cedarterms:Kom ?_Kom_iri.\n",
      "\t?obs cedarterms:population ?pop.\n",
      "\t?slice a qb:Slice.\n",
      "\t?slice qb:observation ?obs.\n",
      "\t?slice sdmx-dimension:refPeriod ?_year_integer.\n",
      "\t?obs cedarterms:houseType ?_houseType_iri.\n",
      "\t?obs cedarterms:residenceStatus ?_residenceStatus_iri .\n",
      "\tFILTER (NOT EXISTS {?obs cedarterms:isTotal ?total })\n",
      "}\n",
      "# foo bar\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/grlc/gquery.py\", line 213, in get_metadata\n",
      "    parsed_query = UpdateUnit.parseString(rq, parseAll=True)\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/pyparsing.py\", line 1129, in parseString\n",
      "    raise exc\n",
      "ParseException: Expected end of text (at char 832), (line:20, col:1)\n",
      "ERROR:grlc.gquery:None\n",
      "INFO:grlc.gquery:Finished parsing query of type SelectQuery\n",
      "WARNING:grlc.gquery:Query metadata could not be parsed; check your YAML syntax\n",
      "INFO:grlc.gquery:Trying to parse udpate query\n",
      "ERROR:grlc.gquery:Could not parse UPDATE query\n",
      "ERROR:grlc.gquery:\n",
      "PREFIX cedar: <http://lod.cedar-project.nl:8888/cedar/resource/>\n",
      "PREFIX maritalstatus: <http://lod.cedar-project.nl/vocab/cedar-maritalstatus#>\n",
      "PREFIX sdmx-dimension: <http://purl.org/linked-data/sdmx/2009/dimension#>\n",
      "PREFIX sdmx-code: <http://purl.org/linked-data/sdmx/2009/code#>\n",
      "PREFIX cedarterms: <http://lod.cedar-project.nl/vocab/cedar#>\n",
      "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
      "PREFIX gg: <http://www.gemeentegeschiedenis.nl/amco/>\n",
      "\n",
      "SELECT (SUM(?pop) AS ?tot) FROM <urn:graph:cedar-mini:release> WHERE {\n",
      "\t?obs a qb:Observation.\n",
      "\t?obs sdmx-dimension:refArea ?_location_iri.\n",
      "\t?obs cedarterms:Kom ?_Kom_iri.\n",
      "\t?obs cedarterms:population ?pop.\n",
      "\t?slice a qb:Slice.\n",
      "\t?slice qb:observation ?obs.\n",
      "\t?slice sdmx-dimension:refPeriod ?_year_integer.\n",
      "\t?obs cedarterms:houseType ?_houseType_iri.\n",
      "\t?obs cedarterms:residenceStatus ?_residenceStatus_iri .\n",
      "\tFILTER (NOT EXISTS {?obs cedarterms:isTotal ?total })\n",
      "}\n",
      "# foo bar\n",
      "\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Traceback (most recent call last):\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/grlc/gquery.py\", line 213, in get_metadata\n",
      "    parsed_query = UpdateUnit.parseString(rq, parseAll=True)\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/pyparsing.py\", line 1129, in parseString\n",
      "    raise exc\n",
      "ParseException: Expected end of text (at char 832), (line:20, col:1)\n",
      "ERROR:grlc.gquery:None\n",
      "INFO:grlc.gquery:Finished parsing query of type SelectQuery\n",
      "WARNING:grlc.gquery:Query metadata could not be parsed; check your YAML syntax\n",
      "INFO:grlc.gquery:Trying to parse udpate query\n",
      "ERROR:grlc.gquery:Could not parse UPDATE query\n",
      "ERROR:grlc.gquery:\n",
      "PREFIX cedar: <http://lod.cedar-project.nl:8888/cedar/resource/>\n",
      "PREFIX maritalstatus: <http://lod.cedar-project.nl/vocab/cedar-maritalstatus#>\n",
      "PREFIX sdmx-dimension: <http://purl.org/linked-data/sdmx/2009/dimension#>\n",
      "PREFIX sdmx-code: <http://purl.org/linked-data/sdmx/2009/code#>\n",
      "PREFIX cedarterms: <http://lod.cedar-project.nl/vocab/cedar#>\n",
      "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
      "PREFIX gg: <http://www.gemeentegeschiedenis.nl/amco/>\n",
      "\n",
      "SELECT (SUM(?pop) AS ?tot) FROM <urn:graph:cedar-mini:release> WHERE {\n",
      "\t?obs a qb:Observation.\n",
      "\t?obs sdmx-dimension:refArea ?_location_iri.\n",
      "\t?obs cedarterms:Kom ?_Kom_iri.\n",
      "\t?obs cedarterms:population ?pop.\n",
      "\t?slice a qb:Slice.\n",
      "\t?slice qb:observation ?obs.\n",
      "\t?slice sdmx-dimension:refPeriod ?_year_integer.\n",
      "\t?obs cedarterms:houseType ?_houseType_iri.\n",
      "\t?obs cedarterms:residenceStatus ?_residenceStatus_iri .\n",
      "\tFILTER (NOT EXISTS {?obs cedarterms:isTotal ?total })\n",
      "}\n",
      "# foo bar\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/grlc/gquery.py\", line 213, in get_metadata\n",
      "    parsed_query = UpdateUnit.parseString(rq, parseAll=True)\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/pyparsing.py\", line 1129, in parseString\n",
      "    raise exc\n",
      "ParseException: Expected end of text (at char 832), (line:20, col:1)\n",
      "ERROR:grlc.gquery:None\n",
      "INFO:grlc.gquery:Finished parsing query of type SelectQuery\n",
      "WARNING:grlc.gquery:Query metadata could not be parsed; check your YAML syntax\n",
      "INFO:grlc.gquery:Trying to parse udpate query\n",
      "ERROR:grlc.gquery:Could not parse UPDATE query\n",
      "ERROR:grlc.gquery:\n",
      "PREFIX cedar: <http://lod.cedar-project.nl:8888/cedar/resource/>\n",
      "PREFIX maritalstatus: <http://lod.cedar-project.nl/vocab/cedar-maritalstatus#>\n",
      "PREFIX sdmx-dimension: <http://purl.org/linked-data/sdmx/2009/dimension#>\n",
      "PREFIX sdmx-code: <http://purl.org/linked-data/sdmx/2009/code#>\n",
      "PREFIX cedarterms: <http://lod.cedar-project.nl/vocab/cedar#>\n",
      "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
      "PREFIX gg: <http://www.gemeentegeschiedenis.nl/amco/>\n",
      "\n",
      "SELECT (SUM(?pop) AS ?tot) FROM <urn:graph:cedar-mini:release> WHERE {\n",
      "\t?obs a qb:Observation.\n",
      "\t?obs sdmx-dimension:refArea ?_location_iri.\n",
      "\t?obs cedarterms:Kom ?_Kom_iri.\n",
      "\t?obs cedarterms:population ?pop.\n",
      "\t?slice a qb:Slice.\n",
      "\t?slice qb:observation ?obs.\n",
      "\t?slice sdmx-dimension:refPeriod ?_year_integer.\n",
      "\t?obs cedarterms:houseType ?_houseType_iri.\n",
      "\t?obs cedarterms:residenceStatus ?_residenceStatus_iri .\n",
      "\tFILTER (NOT EXISTS {?obs cedarterms:isTotal ?total })\n",
      "}\n",
      "# foo bar\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/grlc/gquery.py\", line 213, in get_metadata\n",
      "    parsed_query = UpdateUnit.parseString(rq, parseAll=True)\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/pyparsing.py\", line 1129, in parseString\n",
      "    raise exc\n",
      "ParseException: Expected end of text (at char 832), (line:20, col:1)\n",
      "ERROR:grlc.gquery:None\n",
      "INFO:grlc.gquery:Finished parsing query of type SelectQuery\n",
      "INFO:requests.packages.urllib3.connectionpool:Starting new HTTPS connection (1): raw.githubusercontent.com\n",
      "INFO:grlc.utils:===================================================================\n",
      "INFO:grlc.utils:Processing TPF query: led_zeppelin_dbp.tpf\n",
      "INFO:grlc.utils:===================================================================\n",
      "INFO:requests.packages.urllib3.connectionpool:Starting new HTTPS connection (1): raw.githubusercontent.com\n",
      "INFO:grlc.utils:===================================================================\n",
      "INFO:grlc.utils:Processing SPARQL query: rdfa_example.rq\n",
      "INFO:grlc.utils:===================================================================\n",
      "INFO:grlc.gquery:Trying to parse udpate query\n",
      "ERROR:grlc.gquery:Could not parse UPDATE query\n",
      "ERROR:grlc.gquery:\n",
      "SELECT * WHERE {\n",
      "    ?s ?p ?o .\n",
      "}\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/grlc/gquery.py\", line 213, in get_metadata\n",
      "    parsed_query = UpdateUnit.parseString(rq, parseAll=True)\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/pyparsing.py\", line 1129, in parseString\n",
      "    raise exc\n",
      "ParseException: Expected end of text (at char 164), (line:7, col:1)\n",
      "ERROR:grlc.gquery:None\n",
      "INFO:grlc.gquery:Finished parsing query of type SelectQuery\n",
      "INFO:grlc.gquery:Decorator guessed endpoint: http://iricelino.org/rdfa/sample-annotated-page.html\n",
      "INFO:requests.packages.urllib3.connectionpool:Starting new HTTPS connection (1): raw.githubusercontent.com\n",
      "INFO:grlc.utils:===================================================================\n",
      "INFO:grlc.utils:Processing SPARQL query: statusbybirtyear_mult.rq\n",
      "INFO:grlc.utils:===================================================================\n",
      "WARNING:grlc.gquery:Query metadata could not be parsed; check your YAML syntax\n",
      "INFO:grlc.gquery:Trying to parse udpate query\n",
      "ERROR:grlc.gquery:Could not parse UPDATE query\n",
      "ERROR:grlc.gquery:\n",
      "PREFIX napp-dimension: <http://data.socialhistory.org/vocab/napp/dimension/>\n",
      "PREFIX clioprop: <http://data.socialhistory.org/resource/clio/property/>\n",
      "PREFIX clioind: <http://data.socialhistory.org/resource/clio/indicator/>\n",
      "PREFIX clioctr: <http://data.socialhistory.org/resource/clio/country/>\n",
      "PREFIX nappctr: <http://data.socialhistory.org/resource/napp/CNTRY/>\n",
      "PREFIX hisco: <http://data.socialhistory.org/vocab/hisco/>\n",
      "PREFIX hiscam: <http://data.socialhistory.org/vocab/hiscam/>\n",
      "PREFIX sdmx-dimension: <http://purl.org/linked-data/sdmx/2009/dimension#>\n",
      "PREFIX sdmx-measure: <http://purl.org/linked-data/sdmx/2009/measure#>\n",
      "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "\n",
      "SELECT ?occhisco ?hisco ?hiscam ?gdppc ?year ?age\n",
      "FROM <http://data.socialhistory.org/resource/napp/dataset/sweden1890>\n",
      "FROM <http://data.socialhistory.org/resource/napp/dataset/canada1891>\n",
      "FROM <http://data.socialhistory.org/vocab/hisco/>\n",
      "FROM <http://data.socialhistory.org/resource/gdppc/assertion/5343176a06654392f04b0dcf163d1f1f0f65ffce/2016-01-21T16:30:48.081802>\n",
      "WHERE {\n",
      "    # get right clio data and year for right country\n",
      "    ?dataset clioprop:indicator clioind:GDPPC1990GKD .\n",
      "    ?dataset sdmx-dimension:refArea ?_clioctr .\n",
      "    ?dataset sdmx-measure:obsValue ?gdppc .\n",
      "    ?dataset sdmx-dimension:refPeriod ?year .\n",
      "    FILTER(xsd:int(str(?year)) < 1891) .\n",
      "    \n",
      "    OPTIONAL{\n",
      "        # select variables of interest and filter out bad obs. from census\n",
      "        ?person napp-dimension:AGE ?age .\n",
      "        ?person napp-dimension:YEAR ?censusyear .        \n",
      "        FILTER((?censusyear - ?age) = (xsd:int(str(?year))) && ?age != 999 && ?age > 12) .\n",
      "        ?person napp-dimension:OCCHISCO ?occhisco .\n",
      "        ?person napp-dimension:CNTRY ?_nappctr .\n",
      "        FILTER(?occhisco != 99999) . \n",
      "\n",
      "        # occupational mapping\n",
      "        ?occhisco (skos:closeMatch | skos:exactMatch) ?hisco .\n",
      "        ?hiscoentry hisco:hiscoCode ?hisco . \n",
      "        ?hiscoentry hiscam:hiscamValue ?hiscam .\n",
      "        ?hiscoentry qb:refArea hiscam:SE . \n",
      "    }\n",
      "} \n",
      "limit 100\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/grlc/gquery.py\", line 213, in get_metadata\n",
      "    parsed_query = UpdateUnit.parseString(rq, parseAll=True)\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/pyparsing.py\", line 1129, in parseString\n",
      "    raise exc\n",
      "ParseException: Expected end of text (at char 869), (line:20, col:1)\n",
      "ERROR:grlc.gquery:None\n",
      "INFO:grlc.gquery:Finished parsing query of type SelectQuery\n",
      "WARNING:grlc.gquery:Query metadata could not be parsed; check your YAML syntax\n",
      "INFO:requests.packages.urllib3.connectionpool:Starting new HTTPS connection (1): raw.githubusercontent.com\n",
      "WARNING:grlc.gquery:No endpoint specified, using default (http://virtuoso.clariah-sdh.eculture.labs.vu.nl/sparql)\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "WARNING:grlc.gquery:Query metadata could not be parsed; check your YAML syntax\n",
      "INFO:grlc.gquery:Trying to parse udpate query\n",
      "ERROR:grlc.gquery:Could not parse UPDATE query\n",
      "ERROR:grlc.gquery:\n",
      "PREFIX napp-dimension: <http://data.socialhistory.org/vocab/napp/dimension/>\n",
      "PREFIX clioprop: <http://data.socialhistory.org/resource/clio/property/>\n",
      "PREFIX clioind: <http://data.socialhistory.org/resource/clio/indicator/>\n",
      "PREFIX clioctr: <http://data.socialhistory.org/resource/clio/country/>\n",
      "PREFIX nappctr: <http://data.socialhistory.org/resource/napp/CNTRY/>\n",
      "PREFIX hisco: <http://data.socialhistory.org/vocab/hisco/>\n",
      "PREFIX hiscam: <http://data.socialhistory.org/vocab/hiscam/>\n",
      "PREFIX sdmx-dimension: <http://purl.org/linked-data/sdmx/2009/dimension#>\n",
      "PREFIX sdmx-measure: <http://purl.org/linked-data/sdmx/2009/measure#>\n",
      "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "\n",
      "SELECT ?occhisco ?hisco ?hiscam ?gdppc ?year ?age\n",
      "FROM <http://data.socialhistory.org/resource/napp/dataset/sweden1890>\n",
      "FROM <http://data.socialhistory.org/resource/napp/dataset/canada1891>\n",
      "FROM <http://data.socialhistory.org/vocab/hisco/>\n",
      "FROM <http://data.socialhistory.org/resource/gdppc/assertion/5343176a06654392f04b0dcf163d1f1f0f65ffce/2016-01-21T16:30:48.081802>\n",
      "WHERE {\n",
      "    # get right clio data and year for right country\n",
      "    ?dataset clioprop:indicator clioind:GDPPC1990GKD .\n",
      "    ?dataset sdmx-dimension:refArea ?_clioctr .\n",
      "    ?dataset sdmx-measure:obsValue ?gdppc .\n",
      "    ?dataset sdmx-dimension:refPeriod ?year .\n",
      "    FILTER(xsd:int(str(?year)) < 1891) .\n",
      "    \n",
      "    OPTIONAL{\n",
      "        # select variables of interest and filter out bad obs. from census\n",
      "        ?person napp-dimension:AGE ?age .\n",
      "        ?person napp-dimension:YEAR ?censusyear .        \n",
      "        FILTER((?censusyear - ?age) = (xsd:int(str(?year))) && ?age != 999 && ?age > 12) .\n",
      "        ?person napp-dimension:OCCHISCO ?occhisco .\n",
      "        ?person napp-dimension:CNTRY ?_nappctr .\n",
      "        FILTER(?occhisco != 99999) . \n",
      "\n",
      "        # occupational mapping\n",
      "        ?occhisco (skos:closeMatch | skos:exactMatch) ?hisco .\n",
      "        ?hiscoentry hisco:hiscoCode ?hisco . \n",
      "        ?hiscoentry hiscam:hiscamValue ?hiscam .\n",
      "        ?hiscoentry qb:refArea hiscam:SE . \n",
      "    }\n",
      "} \n",
      "limit 100\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/grlc/gquery.py\", line 213, in get_metadata\n",
      "    parsed_query = UpdateUnit.parseString(rq, parseAll=True)\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/pyparsing.py\", line 1129, in parseString\n",
      "    raise exc\n",
      "ParseException: Expected end of text (at char 869), (line:20, col:1)\n",
      "ERROR:grlc.gquery:None\n",
      "INFO:grlc.gquery:Finished parsing query of type SelectQuery\n",
      "WARNING:grlc.gquery:Query metadata could not be parsed; check your YAML syntax\n",
      "INFO:grlc.gquery:Trying to parse udpate query\n",
      "ERROR:grlc.gquery:Could not parse UPDATE query\n",
      "ERROR:grlc.gquery:\n",
      "PREFIX napp-dimension: <http://data.socialhistory.org/vocab/napp/dimension/>\n",
      "PREFIX clioprop: <http://data.socialhistory.org/resource/clio/property/>\n",
      "PREFIX clioind: <http://data.socialhistory.org/resource/clio/indicator/>\n",
      "PREFIX clioctr: <http://data.socialhistory.org/resource/clio/country/>\n",
      "PREFIX nappctr: <http://data.socialhistory.org/resource/napp/CNTRY/>\n",
      "PREFIX hisco: <http://data.socialhistory.org/vocab/hisco/>\n",
      "PREFIX hiscam: <http://data.socialhistory.org/vocab/hiscam/>\n",
      "PREFIX sdmx-dimension: <http://purl.org/linked-data/sdmx/2009/dimension#>\n",
      "PREFIX sdmx-measure: <http://purl.org/linked-data/sdmx/2009/measure#>\n",
      "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "\n",
      "SELECT ?occhisco ?hisco ?hiscam ?gdppc ?year ?age\n",
      "FROM <http://data.socialhistory.org/resource/napp/dataset/sweden1890>\n",
      "FROM <http://data.socialhistory.org/resource/napp/dataset/canada1891>\n",
      "FROM <http://data.socialhistory.org/vocab/hisco/>\n",
      "FROM <http://data.socialhistory.org/resource/gdppc/assertion/5343176a06654392f04b0dcf163d1f1f0f65ffce/2016-01-21T16:30:48.081802>\n",
      "WHERE {\n",
      "    # get right clio data and year for right country\n",
      "    ?dataset clioprop:indicator clioind:GDPPC1990GKD .\n",
      "    ?dataset sdmx-dimension:refArea ?_clioctr .\n",
      "    ?dataset sdmx-measure:obsValue ?gdppc .\n",
      "    ?dataset sdmx-dimension:refPeriod ?year .\n",
      "    FILTER(xsd:int(str(?year)) < 1891) .\n",
      "    \n",
      "    OPTIONAL{\n",
      "        # select variables of interest and filter out bad obs. from census\n",
      "        ?person napp-dimension:AGE ?age .\n",
      "        ?person napp-dimension:YEAR ?censusyear .        \n",
      "        FILTER((?censusyear - ?age) = (xsd:int(str(?year))) && ?age != 999 && ?age > 12) .\n",
      "        ?person napp-dimension:OCCHISCO ?occhisco .\n",
      "        ?person napp-dimension:CNTRY ?_nappctr .\n",
      "        FILTER(?occhisco != 99999) . \n",
      "\n",
      "        # occupational mapping\n",
      "        ?occhisco (skos:closeMatch | skos:exactMatch) ?hisco .\n",
      "        ?hiscoentry hisco:hiscoCode ?hisco . \n",
      "        ?hiscoentry hiscam:hiscamValue ?hiscam .\n",
      "        ?hiscoentry qb:refArea hiscam:SE . \n",
      "    }\n",
      "} \n",
      "limit 100\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/grlc/gquery.py\", line 213, in get_metadata\n",
      "    parsed_query = UpdateUnit.parseString(rq, parseAll=True)\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/pyparsing.py\", line 1129, in parseString\n",
      "    raise exc\n",
      "ParseException: Expected end of text (at char 869), (line:20, col:1)\n",
      "ERROR:grlc.gquery:None\n",
      "INFO:grlc.gquery:Finished parsing query of type SelectQuery\n",
      "INFO:requests.packages.urllib3.connectionpool:Starting new HTTPS connection (1): raw.githubusercontent.com\n",
      "INFO:grlc.utils:===================================================================\n",
      "INFO:grlc.utils:Processing SPARQL query: statusbybirtyear_mult_shouldwork.rq\n",
      "INFO:grlc.utils:===================================================================\n",
      "INFO:grlc.gquery:Trying to parse udpate query\n",
      "ERROR:grlc.gquery:Could not parse UPDATE query\n",
      "ERROR:grlc.gquery:\n",
      "PREFIX napp-dimension: <http://data.socialhistory.org/vocab/napp/dimension/>\n",
      "PREFIX clioprop: <http://data.socialhistory.org/resource/clio/property/>\n",
      "PREFIX clioind: <http://data.socialhistory.org/resource/clio/indicator/>\n",
      "PREFIX clioctr: <http://data.socialhistory.org/resource/clio/country/>\n",
      "PREFIX nappctr: <http://data.socialhistory.org/resource/napp/CNTRY/>\n",
      "PREFIX hisco: <http://data.socialhistory.org/vocab/hisco/>\n",
      "PREFIX hiscam: <http://data.socialhistory.org/vocab/hiscam/>\n",
      "PREFIX sdmx-dimension: <http://purl.org/linked-data/sdmx/2009/dimension#>\n",
      "PREFIX sdmx-measure: <http://purl.org/linked-data/sdmx/2009/measure#>\n",
      "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "\n",
      "SELECT ?occhisco ?hisco ?hiscam ?gdppc ?year ?age\n",
      "FROM <http://data.socialhistory.org/resource/napp/dataset/sweden1890>\n",
      "FROM <http://data.socialhistory.org/resource/napp/dataset/canada1891>\n",
      "FROM <http://data.socialhistory.org/vocab/hisco/>\n",
      "FROM <http://data.socialhistory.org/resource/gdppc/assertion/5343176a06654392f04b0dcf163d1f1f0f65ffce/2016-01-21T16:30:48.081802>\n",
      "WHERE {\n",
      "    # get right clio data and year for right country\n",
      "    ?dataset clioprop:indicator clioind:GDPPC1990GKD .\n",
      "    ?dataset sdmx-dimension:refArea ?_clioctr .\n",
      "    ?dataset sdmx-measure:obsValue ?gdppc .\n",
      "    ?dataset sdmx-dimension:refPeriod ?year .\n",
      "    FILTER(xsd:int(str(?year)) < 1891) .\n",
      "    \n",
      "    OPTIONAL{\n",
      "        # select variables of interest and filter out bad obs. from census\n",
      "        ?person napp-dimension:AGE ?age .\n",
      "        ?person napp-dimension:YEAR ?censusyear .        \n",
      "        FILTER((?censusyear - ?age) = (xsd:int(str(?year))) && ?age != 999 && ?age > 12) .\n",
      "        ?person napp-dimension:OCCHISCO ?occhisco .\n",
      "        ?person napp-dimension:CNTRY ?_nappctr .\n",
      "        FILTER(?occhisco != 99999) . \n",
      "\n",
      "        # occupational mapping\n",
      "        ?occhisco (skos:closeMatch | skos:exactMatch) ?hisco .\n",
      "        ?hiscoentry hisco:hiscoCode ?hisco . \n",
      "        ?hiscoentry hiscam:hiscamValue ?hiscam .\n",
      "        ?hiscoentry qb:refArea hiscam:SE . \n",
      "    }\n",
      "} \n",
      "limit 100\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/grlc/gquery.py\", line 213, in get_metadata\n",
      "    parsed_query = UpdateUnit.parseString(rq, parseAll=True)\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/pyparsing.py\", line 1129, in parseString\n",
      "    raise exc\n",
      "ParseException: Expected end of text (at char 878), (line:20, col:1)\n",
      "ERROR:grlc.gquery:None\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:grlc.gquery:Finished parsing query of type SelectQuery\n",
      "INFO:requests.packages.urllib3.connectionpool:Starting new HTTPS connection (1): raw.githubusercontent.com\n",
      "WARNING:grlc.gquery:No endpoint specified, using default (http://virtuoso.clariah-sdh.eculture.labs.vu.nl/sparql)\n",
      "INFO:grlc.gquery:Trying to parse udpate query\n",
      "ERROR:grlc.gquery:Could not parse UPDATE query\n",
      "ERROR:grlc.gquery:\n",
      "PREFIX napp-dimension: <http://data.socialhistory.org/vocab/napp/dimension/>\n",
      "PREFIX clioprop: <http://data.socialhistory.org/resource/clio/property/>\n",
      "PREFIX clioind: <http://data.socialhistory.org/resource/clio/indicator/>\n",
      "PREFIX clioctr: <http://data.socialhistory.org/resource/clio/country/>\n",
      "PREFIX nappctr: <http://data.socialhistory.org/resource/napp/CNTRY/>\n",
      "PREFIX hisco: <http://data.socialhistory.org/vocab/hisco/>\n",
      "PREFIX hiscam: <http://data.socialhistory.org/vocab/hiscam/>\n",
      "PREFIX sdmx-dimension: <http://purl.org/linked-data/sdmx/2009/dimension#>\n",
      "PREFIX sdmx-measure: <http://purl.org/linked-data/sdmx/2009/measure#>\n",
      "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "\n",
      "SELECT ?occhisco ?hisco ?hiscam ?gdppc ?year ?age\n",
      "FROM <http://data.socialhistory.org/resource/napp/dataset/sweden1890>\n",
      "FROM <http://data.socialhistory.org/resource/napp/dataset/canada1891>\n",
      "FROM <http://data.socialhistory.org/vocab/hisco/>\n",
      "FROM <http://data.socialhistory.org/resource/gdppc/assertion/5343176a06654392f04b0dcf163d1f1f0f65ffce/2016-01-21T16:30:48.081802>\n",
      "WHERE {\n",
      "    # get right clio data and year for right country\n",
      "    ?dataset clioprop:indicator clioind:GDPPC1990GKD .\n",
      "    ?dataset sdmx-dimension:refArea ?_clioctr .\n",
      "    ?dataset sdmx-measure:obsValue ?gdppc .\n",
      "    ?dataset sdmx-dimension:refPeriod ?year .\n",
      "    FILTER(xsd:int(str(?year)) < 1891) .\n",
      "    \n",
      "    OPTIONAL{\n",
      "        # select variables of interest and filter out bad obs. from census\n",
      "        ?person napp-dimension:AGE ?age .\n",
      "        ?person napp-dimension:YEAR ?censusyear .        \n",
      "        FILTER((?censusyear - ?age) = (xsd:int(str(?year))) && ?age != 999 && ?age > 12) .\n",
      "        ?person napp-dimension:OCCHISCO ?occhisco .\n",
      "        ?person napp-dimension:CNTRY ?_nappctr .\n",
      "        FILTER(?occhisco != 99999) . \n",
      "\n",
      "        # occupational mapping\n",
      "        ?occhisco (skos:closeMatch | skos:exactMatch) ?hisco .\n",
      "        ?hiscoentry hisco:hiscoCode ?hisco . \n",
      "        ?hiscoentry hiscam:hiscamValue ?hiscam .\n",
      "        ?hiscoentry qb:refArea hiscam:SE . \n",
      "    }\n",
      "} \n",
      "limit 100\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/grlc/gquery.py\", line 213, in get_metadata\n",
      "    parsed_query = UpdateUnit.parseString(rq, parseAll=True)\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/pyparsing.py\", line 1129, in parseString\n",
      "    raise exc\n",
      "ParseException: Expected end of text (at char 878), (line:20, col:1)\n",
      "ERROR:grlc.gquery:None\n",
      "INFO:grlc.gquery:Finished parsing query of type SelectQuery\n",
      "INFO:grlc.gquery:Trying to parse udpate query\n",
      "ERROR:grlc.gquery:Could not parse UPDATE query\n",
      "ERROR:grlc.gquery:\n",
      "PREFIX napp-dimension: <http://data.socialhistory.org/vocab/napp/dimension/>\n",
      "PREFIX clioprop: <http://data.socialhistory.org/resource/clio/property/>\n",
      "PREFIX clioind: <http://data.socialhistory.org/resource/clio/indicator/>\n",
      "PREFIX clioctr: <http://data.socialhistory.org/resource/clio/country/>\n",
      "PREFIX nappctr: <http://data.socialhistory.org/resource/napp/CNTRY/>\n",
      "PREFIX hisco: <http://data.socialhistory.org/vocab/hisco/>\n",
      "PREFIX hiscam: <http://data.socialhistory.org/vocab/hiscam/>\n",
      "PREFIX sdmx-dimension: <http://purl.org/linked-data/sdmx/2009/dimension#>\n",
      "PREFIX sdmx-measure: <http://purl.org/linked-data/sdmx/2009/measure#>\n",
      "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "\n",
      "SELECT ?occhisco ?hisco ?hiscam ?gdppc ?year ?age\n",
      "FROM <http://data.socialhistory.org/resource/napp/dataset/sweden1890>\n",
      "FROM <http://data.socialhistory.org/resource/napp/dataset/canada1891>\n",
      "FROM <http://data.socialhistory.org/vocab/hisco/>\n",
      "FROM <http://data.socialhistory.org/resource/gdppc/assertion/5343176a06654392f04b0dcf163d1f1f0f65ffce/2016-01-21T16:30:48.081802>\n",
      "WHERE {\n",
      "    # get right clio data and year for right country\n",
      "    ?dataset clioprop:indicator clioind:GDPPC1990GKD .\n",
      "    ?dataset sdmx-dimension:refArea ?_clioctr .\n",
      "    ?dataset sdmx-measure:obsValue ?gdppc .\n",
      "    ?dataset sdmx-dimension:refPeriod ?year .\n",
      "    FILTER(xsd:int(str(?year)) < 1891) .\n",
      "    \n",
      "    OPTIONAL{\n",
      "        # select variables of interest and filter out bad obs. from census\n",
      "        ?person napp-dimension:AGE ?age .\n",
      "        ?person napp-dimension:YEAR ?censusyear .        \n",
      "        FILTER((?censusyear - ?age) = (xsd:int(str(?year))) && ?age != 999 && ?age > 12) .\n",
      "        ?person napp-dimension:OCCHISCO ?occhisco .\n",
      "        ?person napp-dimension:CNTRY ?_nappctr .\n",
      "        FILTER(?occhisco != 99999) . \n",
      "\n",
      "        # occupational mapping\n",
      "        ?occhisco (skos:closeMatch | skos:exactMatch) ?hisco .\n",
      "        ?hiscoentry hisco:hiscoCode ?hisco . \n",
      "        ?hiscoentry hiscam:hiscamValue ?hiscam .\n",
      "        ?hiscoentry qb:refArea hiscam:SE . \n",
      "    }\n",
      "} \n",
      "limit 100\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/grlc/gquery.py\", line 213, in get_metadata\n",
      "    parsed_query = UpdateUnit.parseString(rq, parseAll=True)\n",
      "  File \"/usr/local/lib/python2.7/dist-packages/pyparsing.py\", line 1129, in parseString\n",
      "    raise exc\n",
      "ParseException: Expected end of text (at char 878), (line:20, col:1)\n",
      "ERROR:grlc.gquery:None\n",
      "INFO:grlc.gquery:Finished parsing query of type SelectQuery\n"
     ]
    }
   ],
   "source": [
    "# from grlc import server\n",
    "from grlc import utils\n",
    "\n",
    "help(utils.build_swagger_spec)\n",
    "\n",
    "spec = utils.build_swagger_spec('albertmeronyo', 'lodapi', None, 'localhost', None)\n",
    "# print spec"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.15rc1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
